app/Models/PekerjaanModel.php

    public function getPekerjaan($id)
    {
        $builder = $this->db->table("tb_pekerjaan");
        $builder->where('id_pekerjaan', $id);

        return $builder->get()->getResult();
---
SELECT *
FROM `tb_pekerjaan`
WHERE `id_pekerjaan` = '3'

    public function getPekerja($id)
    {
        $builder = $this->db->table("tb_pekerja");
        $builder->where('pekerjaan_id', $id);
        $builder->orderBy('id_pekerja', 'DESC');

        return $builder->get()->getResult();
---
SELECT *
FROM `tb_pekerja`
WHERE `pekerjaan_id` = '1'
ORDER BY `id_pekerja` DESC

    public function getPekerjaById($id)
    {
        $builder = $this->db->table("tb_pekerja");
        $builder->where('id_pekerja', $id);

        return $builder->get()->getResult();
---
SELECT *
FROM `tb_pekerja`
WHERE `id_pekerja` = '857'

    public function searchPekerja($nama, $tgl_lahir, $id)
    {
        $builder = $this->db->table("tb_pekerja");
        $builder->where('nama', $nama);
        $builder->where('tgl_lahir', $tgl_lahir);
        $builder->where('pekerjaan_id', $id);

        return $builder->get()->getResult();
---
SELECT *
FROM `tb_pekerja`
WHERE `nama` = 'iding'
AND `tgl_lahir` = '1971-12-01'
AND `pekerjaan_id` = '3'

    public function editData($data, $where)
    {
        $this->db->table("tb_pekerja")->update($data, $where);
---
UPDATE `tb_pekerja` SET `id_pekerja` = '856', `nama` = 'Test edit', `tgl_lahir` = '2002-02-02', `operator` = 'Test edit', `pekerjaan_id` = '1', `npwp` = 'edit', `nama_pt` = 'edit', `alamat_pt` = 'edit'
WHERE `id_pekerja` = '856'