app/Models/PenggunaModel.php

    public function getPenggunaById($id)
    {
        $builder = $this->db->table("tb_pengguna");
        $builder->where('id_pengguna', $id);

        return $builder->get()->getResult();
---
SELECT *
FROM `tb_pengguna`
WHERE `id_pengguna` = '8'

    public function editData($data, $where)
    {
        $this->db->table("tb_pengguna")->update($data, $where);
---
UPDATE `tb_pengguna` SET `id_pengguna` = '8', `nama_pengguna` = 'Test', `username` = 'test', `password` = '$2y$10$SXfRC75OdlDKfkYBYkIX7OoR8MvWW0x4EhQrE/kw0OTEgoCgSiFoq'
WHERE `id_pengguna` = '8'